In [71]:
import pandas as pd

## 예제 8-4  사용자 정의 함수를 apply 메소드로  처리하기

In [72]:
import numpy as np

In [73]:
df = pd.DataFrame ({'a' : np.random.randn(6),
                 'b' : ['철수', '영희'] * 3,
                 'c' : np.random.randn(6)})

In [74]:
df

          a   b         c
0  0.332593  철수  0.026766
1 -2.019575  영희  1.222478
2 -0.559990  철수  1.310392
3  0.665953  영희  1.375795
4  0.391415  철수  0.129417
5 -0.559731  영희 -0.215025

In [75]:
def my_test(a, c):
    
    return a % c

In [76]:
# lambda 함수는 행단위로 데이터를 처리하는 사용자 함수를 작성한다.
df['Value'] = df.apply(lambda df: my_test(df['a'], df['c']), axis=1)

In [77]:
df

          a   b         c     Value
0  0.332593  철수  0.026766  0.011406
1 -2.019575  영희  1.222478  0.425382
2 -0.559990  철수  1.310392  0.750402
3  0.665953  영희  1.375795  0.665953
4  0.391415  철수  0.129417  0.003164
5 -0.559731  영희 -0.215025 -0.129682

In [78]:
df.a % df.c

0    0.011406
1    0.425382
2    0.750402
3    0.665953
4    0.003164
5   -0.129682
dtype: float64

In [79]:
# 일반함수는 데이터 프레임 전체를 넘겨 열 전체의 값을 반환하는 형태로 작성한다.
# def my_test2(df):
#     return df['a'] % df['c']

In [80]:
# 일반함수는 데이터 프레임 전체를 넘겨 열 전체의 값을 반환하는 형태로 작성한다.
def my_test2(df):
    result = df['a'] % df['c']
    return result

In [81]:
df['Value 2'] = df.apply(my_test2, axis=1)

In [82]:
df

          a   b         c     Value   Value 2
0  0.332593  철수  0.026766  0.011406  0.011406
1 -2.019575  영희  1.222478  0.425382  0.425382
2 -0.559990  철수  1.310392  0.750402  0.750402
3  0.665953  영희  1.375795  0.665953  0.665953
4  0.391415  철수  0.129417  0.003164  0.003164
5 -0.559731  영희 -0.215025 -0.129682 -0.129682

%timeit 를 통해 서로 다른 방식에 대한 성능 비교를 할 수 있다.

In [16]:
%timeit df['Value3'] = df.apply(lambda df: my_test(df['a'], df['c']), axis=1)

730 µs ± 24 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)

In [17]:
%timeit df['Value4'] = df.apply(my_test2, axis=1)

720 µs ± 22.5 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)

In [18]:
sample = pd.DataFrame({'임의의값':[10,100,40] })

In [19]:
sample

   임의의값
0    10
1   100
2    40

In [20]:
# 기존의 데이터 3개와 10만개의 데이터를 곱하여 30만개의 데이터를 생성한다.
# 인덱스는 갱신되어야 하므로 reset_index 함수 인자에 drop=True를 하면 새로운 인덱스로 갱신이된다.
sample = pd.concat([sample]*100000).reset_index(drop=True)

In [21]:
sample.shape

(300000, 1)

In [22]:
sample.head(10)

   임의의값
0    10
1   100
2    40
3    10
4   100
5    40
6    10
7   100
8    40
9    10

In [23]:
sample.shape

(300000, 1)

In [24]:
%timeit sample['임의의값'].apply(lambda x: np.nan if x < 90 else x)

77.2 ms ± 1.57 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [25]:
# 자기자신의 값은 변경되지 않으므로 추후 복제해서 적용해 본다.
sample.head()

   임의의값
0    10
1   100
2    40
3    10
4   100

In [26]:
%timeit sample['임의의값'].mask(sample['임의의값'] < 90, np.nan)

3.43 ms ± 233 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [27]:
sample1 = sample.copy()

In [28]:
sample1 = sample1['임의의값'].apply(lambda x: np.nan if x < 90 else x)

In [29]:
sample1.head()

0      NaN
1    100.0
2      NaN
3      NaN
4    100.0
Name: 임의의값, dtype: float64

In [30]:
sample2 = sample.copy()

In [31]:
sample2 = sample2['임의의값'].mask(sample['임의의값'] < 90, np.nan)

In [32]:
sample2.head()

0      NaN
1    100.0
2      NaN
3      NaN
4    100.0
Name: 임의의값, dtype: float64

In [33]:
(sample1 == sample2).shape

(300000,)

In [34]:
sample1.isnull().sum(), sample1.notnull().sum()

(200000, 100000)

In [35]:
(sample1 == sample2).sum()

100000

## 예제 8-5  사용자 정의 함수를 map,applymap메소드로  처리하기

In [36]:
import numpy as np

In [37]:
ser = pd.Series(np.random.randn(6))

In [38]:
ser

0   -0.204084
1   -0.407808
2   -1.180279
3   -0.970827
4    0.190335
5    0.912120
dtype: float64

In [39]:
df = pd.DataFrame(ser,columns=['관측값_A'])
df

      관측값_A
0 -0.204084
1 -0.407808
2 -1.180279
3 -0.970827
4  0.190335
5  0.912120

In [40]:
def map_test(a):
    print(" 원소별 처리")
    return np.abs(a)

In [41]:
ser.map(map_test)

 원소별 처리
 원소별 처리
 원소별 처리
 원소별 처리
 원소별 처리
 원소별 처리

0    0.204084
1    0.407808
2    1.180279
3    0.970827
4    0.190335
5    0.912120
dtype: float64

In [42]:
s = pd.Series(ser.map(map_test))

 원소별 처리
 원소별 처리
 원소별 처리
 원소별 처리
 원소별 처리
 원소별 처리

In [43]:
s

0    0.204084
1    0.407808
2    1.180279
3    0.970827
4    0.190335
5    0.912120
dtype: float64

In [44]:
df['관측값_A_절대값']=s
df

      관측값_A  관측값_A_절대값
0 -0.204084   0.204084
1 -0.407808   0.407808
2 -1.180279   1.180279
3 -0.970827   0.970827
4  0.190335   0.190335
5  0.912120   0.912120

## 예제 8-6 pipe 메소드 처리하기

In [45]:
import numpy as np

In [46]:
df = pd.DataFrame({"name": ['김상갑', '임종문', '조현웅'],
                   "program language": [np.nan, 'Python', 'Scala'],
                   "born": [pd.NaT, pd.Timestamp("1966-04-25"),
                             pd.NaT]})

In [47]:
df

  name program language       born
0  김상갑              NaN        NaT
1  임종문           Python 1966-04-25
2  조현웅            Scala        NaT

In [48]:
def name_length(df) :
    df['length'] = df.name.str.len()
    return df

In [49]:
# 판다스에서 pipe라는 함수로도 사용자 정의 함수를 지정할 수 있다.

In [50]:
df.pipe(name_length)

  name program language       born  length
0  김상갑              NaN        NaT       3
1  임종문           Python 1966-04-25       3
2  조현웅            Scala        NaT       3

In [51]:
def born_fillna(df) :
    df['born'] = df['born'].fillna(pd.Timestamp("1967-04-25"))
    return df

In [52]:
df.pipe(born_fillna)

  name program language       born  length
0  김상갑              NaN 1967-04-25       3
1  임종문           Python 1966-04-25       3
2  조현웅            Scala 1967-04-25       3

In [53]:
def pl_fillna(df) :
    df['program language'] = df['program language'].fillna("Java")
    return df

In [54]:
df.pipe(pl_fillna)

  name program language       born  length
0  김상갑             Java 1967-04-25       3
1  임종문           Python 1966-04-25       3
2  조현웅            Scala 1967-04-25       3

In [55]:
df1 = pd.DataFrame({"name": ['김상갑', '임종문', '조현웅'],
                   "program language": [np.nan, 'Python', 'Scala'],
                   "born": [pd.NaT, pd.Timestamp("1966-04-25"),
                             pd.NaT]})

In [56]:
df1

  name program language       born
0  김상갑              NaN        NaT
1  임종문           Python 1966-04-25
2  조현웅            Scala        NaT

In [57]:
df1.pipe(name_length).pipe(born_fillna).pipe(pl_fillna)

  name program language       born  length
0  김상갑             Java 1967-04-25       3
1  임종문           Python 1966-04-25       3
2  조현웅            Scala 1967-04-25       3

In [58]:
df2 = pd.DataFrame()

In [59]:
df2['name'] = ['은옥찬', '은석찬', '은옥주']
df2['gender'] = ['Male', 'Male', 'Female']
df2['age'] = [31, 32, 19]

In [60]:
df2

  name  gender  age
0  은옥찬    Male   31
1  은석찬    Male   32
2  은옥주  Female   19

In [61]:
def mean_age_by_group(dataframe, col):
    return dataframe.groupby(col).mean()

In [62]:
mean_age_by_group(df2, 'gender')

         age
gender
Female  19.0
Male    31.5

In [63]:
def uppercase_column_name(dataframe):
    dataframe.columns = dataframe.columns.str.upper()
    return dataframe

In [64]:
uppercase_column_name(df2)

  NAME  GENDER  AGE
0  은옥찬    Male   31
1  은석찬    Male   32
2  은옥주  Female   19

In [68]:
df3 = pd.DataFrame()

In [69]:
df3['name'] = ['구옥찬', '구석찬', '구옥주']
df3['gender'] = ['Male', 'Male', 'Female']
df3['age'] = [31, 32, 19]

In [70]:
df3

  name  gender  age
0  구옥찬    Male   31
1  구석찬    Male   32
2  구옥주  Female   19

In [67]:
(df3.pipe(mean_age_by_group, col='gender')
   .pipe(uppercase_column_name))

         AGE
gender
Female  19.0
Male    31.5